*Exercise 2.26:* Suppose we define `x' and `y' to be two lists:

    (define x (list 1 2 3))

    (define y (list 4 5 6))

What result is printed by the interpreter in response to
evaluating each of the following expressions:

    (append x y)

    (cons x y)

    (list x y)

#+begin_src scheme :results list
(define (append list1 list2)
    (if (null? list1)
        list2
        (cons (car list1) (append (cdr list1) list2))))

(define x (list 1 2 3))
(define y (list 4 5 6))

(list
 (append x y)
 (cons x y)
 (list x y))
#+end_src

#+RESULTS:
- (1 2 3 4 5 6)
- ((1 2 3) 4 5 6)
- ((1 2 3) (4 5 6))
